Repository: createstructure/app-createstructure
Catalog: lib/l10n/app_*.arb
Languages: it

source: App dependencies
it: Dipendenze dell'app

source: App developers
it: Programmatori dell'app

# ask
source: Ask for an help
it: Fai una richiesta di aiuto

# ask_long
source: Ask for a support to the createstructure community and createstructure team (needs GitHub account).
it: Chiedi per un aiuto alla createstructure community e al team di createstructure (è necessario 'account GitHub).

source: Change Token
it: Cambia il token

source: Change Username
it: Cambia l'username

# code_200
source: The repo creation it's requested in few seconds you will have your repository.
it: La richiesta di creazione per la repository è stata inviata. In pochi secondi verrà creata.

source: Continue
it: Continua

source: Core developers
it: Programmatori della parte core

source: Create
it: Crea

source: Create application
it: Creazione dell'app

source: Credentials
it: Credenziali

source: Dependencies
it: Dipendenze

source: Developers
it: Programmatori

source: Done
it: Finito

# en
source: English
it: Inglese

source: ERROR:
it: ERRORE:

# error_repo_name
source: Please, insert, at least, the repo name
it: Inserire, come minimo, il nome della repository

# error_token
source: Before creating a repository, enter the token
it: Prima di creare una repository, inserire token

# error_username
source: Before creating a repository, enter the GitHub username
it: Prima di creare una repository, inserire l'username di GitHub

source: false
it: falso

source: Flutter dependencies
it: Dipendenze di Flutter

source: Help
it: Aiuto

source: Identification
it: Identificazione

source: Insert:
it: Inserisci:

# insert_long
source: Insert here
it: Inserisci quì

# it
source: Italian
it: Italiano

source: Languages
it: Lingue

# languages_default
source: System language
it: Linguaggio di sistema

# languages_long
source: Change language
it: Cambia lingua

# network_error_title
source: Network error
it: Errore di rete

# network_error_description
source: You don't seem to have an internet connection. Unfortunately this feature is fundamental for this app. Please try to fix the connection and then press the button below:
it: Sembra che tu non abbia una connessione internet. Purtroppo questa caratteristica è fondamentale per quest'app. Per piacere prova a sistemare la connessione e poi premere il pulsante di seguito:

# network_error_button
source: Check again the internet connection
it: Riprova

# question_1_long
source: Insert the name of the project:
it: Inserisci il nome del progetto:

# question_1_short
source: Name of the project
it: Nome del progetto

# question_2_long
source: Insert the name of the template:
it: Inserisci il nome del template:

# question_2_short
source: Name of the template
it: Nome del template

# question_3_long
source: Insert the description:
it: Inserisci la descrizione:

# question_3_short
source: Description
it: Descrizione

# question_4_long
source: Insert the prefix (if you want once):
it: Inserisci il prefisso (se ne vuoi uno):

# question_4_short
source: Prefix
it: Prefisso

# question_5_long
source: Insert the Organization name (if you want to put the new project there):
it: Inserisci il nome dell'organizzazione (se è lì che vuoi mettere il nuovo progetto):

# question_5_short
source: Organization name
it: Nome dell'organizzazione

# question_6_long
source: Insert the team (if you use Organization):
it: Inserisci il nome del team (possibile solo se si usa un'Organizzazione):

# question_6_short
source: Organization team
it: Nome del team (dell'Organizzazione)

# question_7_long
source: Insert if you want to create a private repo [Y/n]:
it: Inserisci se vuoi che la repository sia privata [Y/n]:

# question_7_short
source: Private
it: Privato

source: Refresh
it: Ricarica

# refresh_long
source: Press here to refresh info.
it: Ricarica le informazioni.

# repo_descr
source: Repo description:
it: Descrizione della repository:

source: Repo name:
it: Nome della repository:

# repo_org
source: Repo organization:
it: Nome dell'organizzazione:

source: Repo prefix:
it: Prefisso della repository:

# repo_private
source: Is repo private:
it: La repository è privata:

# repo_team
source: Repo organization team:
it: Il team dell'organizione:

source: Repo template:
it: Template della repository:

source: Save
it: Salva

source: Settings
it: Settaggi

# step0
source: General info
it: Informazioni generali

# step2
source: Organization
it: Organizzazione

# step3
source: Summary
it: Riepilogo

# store_application
source: Store application source
it: Gestione codice

source: Submit
it: Invia

source: Subscribe
it: Inscriviti

# subscribe_long
source: Press here to open the subscription page.
it: Premi qui per aprire la pagina web per iscriviti.

source: Summary:
it: Riepilogo:

source: Tools used
it: Strumenti utilizzati

source: true
it: vero

# tutorial_button_3_text
source: Subscribe to GitHub
it: Iscriviti a GitHub

# tutorial_button_4_text
source: Subscribe to createstructure
it: Iscriviti a createstructure

# tutorial_button_5_text
source: Create token
it: Crea il token

# tutorial_long
source: Restart the tutorial
it: Fai ripartire il tutorial

# tutorial_page_1_description
source: 🥳 Welcome to the createstructure app. 🥳 In the following tutorial screens you will understand all what you need to use the application.
it: 🥳 Benvenuto nell'app createstructure. 🥳 Nelle seguenti schermate del tutorial capirai tutto ciò di cui hai bisogno per utilizzare l'applicazione.

# tutorial_page_1_title
source: Welcome
it: Benvenuto

# tutorial_page_2_description
source: createstructure is a service to make it easier and faster the setup for any IT project.
it: createstructure è un servizio per rendere più facile e veloce l'inizializzazione di qualsiasi progetto IT.

# tutorial_page_2_title
source: What is it createstructure?
it: Che cos'è createstructure?

# tutorial_page_3_description
source: The first step for the setup s to create a GitHub account, if you don't have already once. GitHub is the platform where the new projects, called repo, will be created. To make this step easier this is the subscription button:
it: 225 / 5000 Risultati della traduzione Il primo passo per la configurazione è creare un account GitHub, se non lo hai già fatto. GitHub è la piattaforma dove verranno creati i nuovi progetti, chiamati anche repo o repository. Per facilitare questo passaggio questo è il pulsante di iscrizione:

# tutorial_page_4_description
source: The next step is to subscribe to the createstructure service, you can choose the free or the payment subscription. The fast link to do this is:
it: Il passo successivo è quello di abbonarsi al servizio createstructure, puoi scegliere l'abbonamento gratuito o a pagamento. Il collegamento veloce per farlo è:

# tutorial_page_5_description
source: The next step consists to create the token. This token permits the createstructure service to setup the repo for you. Please create the token giving the name you want, custom "Expiration" field and grant "repo", " workflow", "admin:org" and "user". At the end copy to the clipboard the given token. Also in this case there's a fast link:
it: Il passaggio successivo consiste nel creare il token. Questo token consente al servizio createstructure di configurare il repository per te. Crea il token dando il nome che desideri, il campo "Scadenza" personalizzato e concedi "repo", " workflow", "admin:org" e "user". Alla fine copia negli appunti il token dato. Anche in questo caso c'è un collegamento veloce:

# tutorial_page_6_description
source: After this tutorial in the top right you will see ⚙️. Click it and insert the GitHub username and the copied token.
it: Dopo questo tutorial in alto a destra vedrai ⚙️. Fai quindi clic ed inseririsci il usename di GitHub ed il token copiato.

# tutorial_page_7_description
source: When you open the screen, after the configuration, you will have in front of you a form, fill it and at the end press "Submit". Now you are ready to use the app🥳🥳🥳
it: Quando aprirai la schermata, dopo la configurazione, avrai davanti a te un modulo, compilalo e alla fine premi "Invia". Ora sei pronto per usare l'app🥳🥳🥳

# tutorial_page_7_title
source: Usage
it: Utilizzo
